//=============================================================================
//
// LOGO(CREATOR)処理 [logo_creator.h]
// Author : 銭子軒（チェンズーシェン）
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


struct LOGO_CREATOR
{
	XMFLOAT3	pos;		// ポリゴンの座標
	float		w, h;		// 幅と高さ
	int			texNo;		// 使用しているテクスチャ番号

};




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLogoCreator(void);
void UninitLogoCreator(void);
void UpdateLogoCreator(void);
void DrawLogoCreator(void);





